"""  Задача 4: Петя, Катя и Сережа делают
из бумаги журавликов. Вместе они сделали 
S журавликов. Сколько журавликов сделал 
каждый ребенок, если известно, что Петя 
и Сережа сделали одинаковое количество 
журавликов, а Катя сделала в два раза 
больше журавликов, чем Петя и Сережа вместе?
Примеры:
6 -> 1 4 1
24 -> 4 16 4 60 -> 10 40 10
Решение:
Если считать, что мальчики сделали по x 
журавликов, то вместе они сделают 2x, а 
девочка сделала в два раза больше их суммы
Из этого следует: S = 2x + (2x * 2)
S = 6x  чтобы найти х, нужно S разделить на 6
"""
print('Введите S: ')
s = int(input())
print((s//6), ((s//6)*4), (s//6))