"""  Задача 8: Требуется определить, можно ли от шоколадки 
размером n x m долек отломить k долек, если разрешается 
сделать один разлом по прямой между дольками (то есть 
разломить шоколадку на два прямоугольника).
Примеры:
Примечание: каждое считывание производится с новой строки
3 2 4 -> yes
3 2 1 -> no         """

print('Введите n, затем m, затем k (через Enter): ') 
n, m, k = int(input()), int(input()), int(input())
print(['YES', 'NO'][(k % n and k % m)])